app/controllers/visits_controller.rb

SELECT "visits".* FROM "visits"
SELECT country FROM "visits"
---
  def show
    @visits = Visit.all

SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', ("visited_at"::timestamptz - INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC' AS day FROM "visits" WHERE ("visited_at" IS NOT NULL) GROUP BY (DATE_TRUNC('day', ("visited_at"::timestamptz - INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC'
---
  def visits_by_day
    render json: Visit.group_by_day(:visited_at, format: "%B %d, %Y").count

SELECT COUNT(*) AS count_all, country AS country, (DATE_TRUNC('day', ("visited_at"::timestamptz - INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC' AS day FROM "visits" WHERE ("visited_at" IS NOT NULL) GROUP BY country, (DATE_TRUNC('day', ("visited_at"::timestamptz - INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC'
---
  def visits_by_country_day
  	render json: Visit.group(:country).group_by_day(:visited_at, format: "%B %d, %Y").count.chart_json